app/controllers/vehicles_controller.rb

SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`uid` = 'polling'  ORDER BY `vehicles`.`id` ASC LIMIT 1
---
  def show
    vehicle=Vehicle.where(uid: params[:id]).first

SELECT  `locations`.* FROM `locations` WHERE `locations`.`vehicle_id` = 1  ORDER BY `locations`.`id` ASC LIMIT 1
SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`uid` = 'd2d'  ORDER BY `vehicles`.`id` ASC LIMIT 1
---
  def main
    @locations = Location.all
    @hash = Gmaps4rails.build_markers(@locations) do |location, marker|
      marker.lat location.lat
      marker.lng location.lng
    end

    @d2d_location = Vehicle.where(uid: "d2d").first.locations.first