app/views/vehicles/main.html.erb

SELECT  `locations`.* FROM `locations` WHERE `locations`.`vehicle_id` = 1  ORDER BY `locations`.`id` ASC LIMIT 1
SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`uid` = 'd2d'  ORDER BY `vehicles`.`id` ASC LIMIT 1
---
      function timeout_polling() {
        setTimeout(function()
        {
          $.ajax({
              type: "GET",
              url: window.location.origin + window.location.pathname+"/polling",
              dataType :"json",
              success:function(msg){
                handler.removeMarkers(markers)
                markers=msg["vehicles"];
                markers.map(function(marker){
                  console.log(marker);
                  marker.picture={
                  url: marker.picture,
                  width: 32,
                  height: 32
                  };
                });
                console.log(markers);
                markers = handler.addMarkers(markers);
              },
              error:function(msg)